<a href="https://colab.research.google.com/github/gleisonmaia/cienciadados/blob/main/CienciaDados_Aula01_ExploracaoTitanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Importando as bibliotecas do Python
import numpy as np
import scipy as sp
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [16]:
# Criando um dataframe com os dados do arquivo CSV
df_titanic = pd.read_csv("sample_data/titanic.csv")

In [17]:
# Mostrando os primeiros registros da Tabela.
df_titanic.head()

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
## Total de passageiros por sexo
df_titanic.groupby('sex')['passengerid'].count()

sex
female    314
male      577
Name: passengerid, dtype: int64

In [22]:
## Total de sobreviventes por sexo
df_titanic[df_titanic['survived']==1].groupby('sex')['passengerid'].count()

sex
female    233
male      109
Name: passengerid, dtype: int64